cavity/system/controlDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  controlDict;
}

application       pisoFoam;
startFrom         startTime;
startTime         0;
stopAt            endTime;
endTime           150;
deltaT            0.002;
writeControl      timeStep;
writeInterval     250;
purgeWrite        0;
writeFormat       ascii;
writePrecision    6;
writeCompression  off;
timeFormat        general;
timePrecision     6;
runTimeModifiable true;
