cavity/system/blockMeshDict
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  blockMeshDict;
}

convertToMeters 1;

vertices
(
    (0 0 0  )
    (1 0 0  )
    (1 1 0  )
    (0 1 0  )
    (0 0 0.1)
    (1 0 0.1)
    (1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (256 256 1) simpleGrading (1 1 1)
);

boundary
(
    moving_wall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }
    fixed_wall
    {
        type wall;
        faces
        (
            (2 6 5 1)
            (1 5 4 0)
            (0 4 7 3)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 1 2)
            (4 5 6 7)
        );
    }
);