cavity/system/fvSolution
FoamFile
{
    version 2.0;
    format  ascii;
    class   dictionary;
    object  fvSolution;
}

solvers
{
    p
    {
        solver GAMG;
        smoother symGaussSeidel;
        tolerance 1e-6;
        relTol 0.01;
    }

    pFinal
    {
        $p;
        relTol 0;
    }

    "(U|k|B|s|nuTilda)"
    {
        solver smoothSolver;
        smoother symGaussSeidel;
        tolerance 1e-5;
        relTol 0;
    }
}

PISO
{
    nCorrectors 3;
    nNonOrthogonalCorrectors 0;
    pRefCell 0;
    pRefValue 0;
}